MicrochipTech/dspic33a-high-speed-adc-example/adc_dma_40msps.c
    volatile uint16_t *p = &buf[half * SAMPLES_PER_HALF];
    const bool flat = (pinsel_cur == SELFTEST_PINSEL);
    for (uint32_t i = 0; i < SAMPLES_PER_HALF; i++) {
        p[i] = flat ? 3840u : sim_sine[phase];
        if (++phase >= SIM_SINE_PERIOD) { phase = 0u; }
    }

    uint32_t st = half ? _DMA0STAT_DONE_MASK : _DMA0STAT_HALF_MASK;
    st |= sim_fault_once;
    sim_fault_once = 0u;
    half ^= 1u;

    dma0_on_event(st);
}

/* ---- Ping-pong check ----
 * The stand-in writes a known vector, so the consumer side can be held
 * to it exactly: every sample of a completed half, as process_buffer()
 * receives it through capture_completed_half(), must equal the sine
 * table, and the phase must continue from where the previous half
 * ended. A half of 1024 samples advances the phase by 1024 mod 40 = 24,
 * so a half served twice (phase step 0) or two halves swapped (step 8
 * instead of 24) shows up as a mismatch at index 0, and a wrong pointer
 * or a corrupted region shows up at the index where it starts.
 *
 * Runs over SIM_CHECK_HALVES halves (SIM_CHECK_HALVES / 2 full DMA
 * buffers, i.e. that many HALF/DONE round trips), reports the first
 * mismatches and a verdict, then stops so the UART stays quiet. The
 * self-test input (flat 3840) is not part of the check; the check locks
 * on to the phase again at the next sine half. Results are also in
 * sim_check_halves / sim_check_bad / sim_check_done for MDB. */
#define SIM_CHECK_HALVES  100u                 /* 50 full buffers          */
#define SIM_CHECK_REPORT  2u                   /* bad halves to detail     */

volatile uint32_t sim_check_halves = 0;        /* sine halves compared     */
volatile uint32_t sim_check_bad    = 0;        /* halves with a mismatch   */
volatile uint32_t sim_check_done   = 0;        /* 1 once the verdict is out*/
static uint32_t   sim_check_phase  = SIM_SINE_PERIOD;   /* >= PERIOD: unknown */

/* Table index k with sim_sine[k] == a and sim_sine[k+1] == b, or
 * SIM_SINE_PERIOD if the pair is not two consecutive table entries. Two
 * samples are needed: a single value occurs twice per period. */
static uint32_t sim_phase_of(uint16_t a, uint16_t b)
{
    for (uint32_t k = 0; k < SIM_SINE_PERIOD; k++) {
        if ((sim_sine[k] == a) && (sim_sine[(k + 1u) % SIM_SINE_PERIOD] == b)) {
            return k;
        }
    }
    return SIM_SINE_PERIOD;
}

static void sim_check_half(const volatile uint16_t *b, uint32_t n)
{
    if (sim_check_done) {
        return;
    }
    if ((b[0] == 3840u) && (b[1] == 3840u)) {  /* self-test input        */
        sim_check_phase = SIM_SINE_PERIOD;
        return;
    }

    uint32_t k = sim_check_phase;
    if (k >= SIM_SINE_PERIOD) {                /* first half: lock on     */
        k = sim_phase_of(b[0], b[1]);
    }

    uint32_t bad_at = n;
    if (k >= SIM_SINE_PERIOD) {
        bad_at = 0u;                           /* not even a sine start   */
    } else {
        for (uint32_t i = 0; i < n; i++) {
            if (b[i] != sim_sine[k]) { bad_at = i; break; }
            if (++k >= SIM_SINE_PERIOD) { k = 0u; }
        }
    }

    if (bad_at < n) {
        sim_check_bad++;
        if (sim_check_bad <= SIM_CHECK_REPORT) {
            console_kv("[simtest] mismatch in half", sim_check_halves);
            console_kv("[simtest]   index", bad_at);
            console_kv("[simtest]   got", b[bad_at]);
            console_kv("[simtest]   expected", (sim_check_phase < SIM_SINE_PERIOD)
                       ? sim_sine[(sim_check_phase + bad_at) % SIM_SINE_PERIOD] : 0u);
        }
        sim_check_phase = SIM_SINE_PERIOD;     /* re-lock on the next half*/
    } else {
        sim_check_phase = k;                   /* phase of the next sample*/
    }

    if (++sim_check_halves >= SIM_CHECK_HALVES) {
        sim_check_done = 1u;
        console_kv("[simtest] halves compared against the sine vector", sim_check_halves);
        console_kv("[simtest] full ping-pong buffers", sim_check_halves / 2u);
        console_kv("[simtest] halves with a mismatch", sim_check_bad);
        console_puts(sim_check_bad ? "[simtest] FAIL\r\n" : "[simtest] PASS: ping-pong order and data intact\r\n");
    }
}
#endif

/* ------------------------------------------------------------------ *
 * Control API (adc_dma_40msps.h)
 * ------------------------------------------------------------------ */
void capture_start(void)
{
    run_enabled = true;
    if (!burst_active) {
        adc_start_burst();
    }
}

void capture_stop(void)
{
    run_enabled = false;
}

bool capture_running(void)
{
    return run_enabled;
}

bool capture_set_input(uint8_t pinsel, uint8_t samc)
{
    if ((pinsel > 15u) || (samc > 31u)) {
        return false;
    }
    pinsel_next = pinsel;
    samc_next   = samc;
    switch_pending = true;
    if (!burst_active) {
        /* Nothing running: apply right away, the channel is idle. */
        ADCREG(CH0CON1bits).PINSEL = pinsel;
        ADCREG(CH0CON1bits).SAMC   = samc;
        pinsel_cur = pinsel;
        samc_cur   = samc;
        switch_pending = false;
    }
    return true;
}

uint8_t capture_pinsel(void) { return pinsel_cur; }
uint8_t capture_samc(void)   { return samc_cur; }

const volatile uint16_t *capture_completed_half(void)
{
    return &buf[ready_half ? SAMPLES_PER_HALF : 0u];
}

void counters_clear(void)
{
    dma_overrun = 0; dma_addr_err = 0; dma_bus_err = 0;
    late_service = 0; proc_missed = 0;
    /* Halves completed up to now are not "missed" from here on. Without
     * this the first capture_service() after the self-test books its
     * 12 unserviced halves as proc_missed, and the heartbeat goes to the
     * error rate before the measurement has even started. */
    seen_blocks = blocks_done;
}

void led_init(void)
{
    LED_OFF();
    LED_TRIS = 0u;
}

void led_mode(uint8_t mode)
{
    led_auto = mode;
    if (mode == 0u)      { LED_OFF(); }
    else if (mode == 1u) { LED_ON();  }
}

uint8_t led_get_mode(void) { return led_auto; }

/* ------------------------------------------------------------------ *
 * Process one completed buffer half
 *
 * Placeholder for the customer's "+ and -" arithmetic. Written as a
 * plain accumulate so the cost of touching every sample is visible in
 * the measurement: at 40 MSPS this loop sees 40 million values per
 * second and per channel, and whether the CPU keeps up is as much a
 * question as the DMA bandwidth.
 * ------------------------------------------------------------------ */
static void process_buffer(const volatile uint16_t *b, uint32_t n)
{
    int32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += (int32_t)b[i];
    }
    proc_result = acc;
#ifdef __MPLAB_DEBUGGER_SIMULATOR
    sim_check_half(b, n);             /* is this really the next half?  */
#endif
}

static uint32_t half_mean(const volatile uint16_t *b, uint32_t n)
{
    uint32_t acc = 0;
    for (uint32_t i = 0; i < n; i++) {
        acc += b[i];
    }
    return acc / n;
}

bool capture_service(void)
{
    const uint32_t done = blocks_done;
    if (done == seen_blocks) {
        return false;
    }
    if ((done - seen_blocks) > 1u) {
        proc_missed += (done - seen_blocks) - 1u;
    }
    seen_blocks = done;
    process_buffer(capture_completed_half(), SAMPLES_PER_HALF);

